stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_tim_ex.c
  /* Set the Lock level, the Break enable Bit and the Polarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */

  /* Set the BDTR bits */
  MODIFY_REG(tmpbdtr, TIM_BDTR_DTG, sBreakDeadTimeConfig->DeadTime);
  MODIFY_REG(tmpbdtr, TIM_BDTR_LOCK, sBreakDeadTimeConfig->LockLevel);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSI, sBreakDeadTimeConfig->OffStateIDLEMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_OSSR, sBreakDeadTimeConfig->OffStateRunMode);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKE, sBreakDeadTimeConfig->BreakState);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKP, sBreakDeadTimeConfig->BreakPolarity);
  MODIFY_REG(tmpbdtr, TIM_BDTR_AOE, sBreakDeadTimeConfig->AutomaticOutput);
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKF, (sBreakDeadTimeConfig->BreakFilter << TIM_BDTR_BKF_Pos));
  MODIFY_REG(tmpbdtr, TIM_BDTR_BKBID, sBreakDeadTimeConfig->BreakAFMode);

  if (IS_TIM_BKIN2_INSTANCE(htim->Instance))
  {
    /* Check the parameters */
    assert_param(IS_TIM_BREAK2_STATE(sBreakDeadTimeConfig->Break2State));
    assert_param(IS_TIM_BREAK2_POLARITY(sBreakDeadTimeConfig->Break2Polarity));
    assert_param(IS_TIM_BREAK_FILTER(sBreakDeadTimeConfig->Break2Filter));
    assert_param(IS_TIM_BREAK2_AFMODE(sBreakDeadTimeConfig->Break2AFMode));

    /* Set the BREAK2 input related BDTR bits */
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2F, (sBreakDeadTimeConfig->Break2Filter << TIM_BDTR_BK2F_Pos));
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2E, sBreakDeadTimeConfig->Break2State);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2P, sBreakDeadTimeConfig->Break2Polarity);
    MODIFY_REG(tmpbdtr, TIM_BDTR_BK2BID, sBreakDeadTimeConfig->Break2AFMode);
  }

  /* Set TIMx_BDTR */
  htim->Instance->BDTR = tmpbdtr;

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Configures the break input source.
  * @param  htim TIM handle.
  * @param  BreakInput Break input to configure
  *          This parameter can be one of the following values:
  *            @arg TIM_BREAKINPUT_BRK: Timer break input
  *            @arg TIM_BREAKINPUT_BRK2: Timer break 2 input
  * @param  sBreakInputConfig Break input source configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_ConfigBreakInput(TIM_HandleTypeDef *htim,
                                             uint32_t BreakInput,
                                             const TIMEx_BreakInputConfigTypeDef *sBreakInputConfig)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tmporx;
  uint32_t bkin_enable_mask;
  uint32_t bkin_polarity_mask;
  uint32_t bkin_enable_bitpos;
  uint32_t bkin_polarity_bitpos;

  /* Check the parameters */
  assert_param(IS_TIM_BREAK_INSTANCE(htim->Instance));
  assert_param(IS_TIM_BREAKINPUT(BreakInput));
  assert_param(IS_TIM_BREAKINPUTSOURCE(sBreakInputConfig->Source));
  assert_param(IS_TIM_BREAKINPUTSOURCE_STATE(sBreakInputConfig->Enable));
  assert_param(IS_TIM_BREAKINPUTSOURCE_POLARITY(sBreakInputConfig->Polarity));

  /* Check input state */
  __HAL_LOCK(htim);

  switch (sBreakInputConfig->Source)
  {
    case TIM_BREAKINPUTSOURCE_BKIN:
    {
      bkin_enable_mask = TIM_AF1_BKINE;
      bkin_enable_bitpos = TIM_AF1_BKINE_Pos;
      bkin_polarity_mask = TIM_AF1_BKINP;
      bkin_polarity_bitpos = TIM_AF1_BKINP_Pos;
      break;
    }
    case TIM_BREAKINPUTSOURCE_COMP1:
    {
      bkin_enable_mask = TIM_AF1_BKCMP1E;
      bkin_enable_bitpos = TIM_AF1_BKCMP1E_Pos;
      bkin_polarity_mask = TIM_AF1_BKCMP1P;
      bkin_polarity_bitpos = TIM_AF1_BKCMP1P_Pos;
      break;
    }
    case TIM_BREAKINPUTSOURCE_COMP2:
    {
      bkin_enable_mask = TIM_AF1_BKCMP2E;
      bkin_enable_bitpos = TIM_AF1_BKCMP2E_Pos;
      bkin_polarity_mask = TIM_AF1_BKCMP2P;
      bkin_polarity_bitpos = TIM_AF1_BKCMP2P_Pos;
      break;
    }

    default:
    {
      bkin_enable_mask = 0U;
      bkin_polarity_mask = 0U;
      bkin_enable_bitpos = 0U;
      bkin_polarity_bitpos = 0U;
      break;
    }
  }

  switch (BreakInput)
  {
    case TIM_BREAKINPUT_BRK:
    {
      /* Get the TIMx_AF1 register value */
      tmporx = htim->Instance->AF1;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF1 */
      htim->Instance->AF1 = tmporx;
      break;
    }
    case TIM_BREAKINPUT_BRK2:
    {
      /* Get the TIMx_AF2 register value */
      tmporx = htim->Instance->AF2;

      /* Enable the break input */
      tmporx &= ~bkin_enable_mask;
      tmporx |= (sBreakInputConfig->Enable << bkin_enable_bitpos) & bkin_enable_mask;

      /* Set the break input polarity */
      tmporx &= ~bkin_polarity_mask;
      tmporx |= (sBreakInputConfig->Polarity << bkin_polarity_bitpos) & bkin_polarity_mask;

      /* Set TIMx_AF2 */
      htim->Instance->AF2 = tmporx;
      break;
    }
    default:
      status = HAL_ERROR;
      break;
  }

  __HAL_UNLOCK(htim);

  return status;
}

/**
  * @brief  Configures the TIMx Remapping input capabilities.
  * @param  htim TIM handle.
  * @param  Remap specifies the TIM remapping source.
  *         For TIM1, the parameter can take one of the following values:
  *            @arg TIM_TIM1_ETR_GPIO           TIM1 ETR is connected to GPIO
  *            @arg TIM_TIM1_ETR_COMP1          TIM1 ETR is connected to COMP1 OUT
  *            @arg TIM_TIM1_ETR_COMP2          TIM1 ETR is connected to COMP2 OUT
  *            @arg TIM_TIM1_ETR_MSIK           TIM1 ETR is connected to MSIK
  *            @arg TIM_TIM1_ETR_HSI            TIM1 ETR is connected to HSI
  *            @arg TIM_TIM1_ETR_ADC1_AWD1      TIM1 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM1_ETR_ADC1_AWD2      TIM1 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM1_ETR_ADC1_AWD3      TIM1 ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM1_ETR_ADC2_AWD1      TIM1 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM1_ETR_ADC2_AWD2      TIM1 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM1_ETR_ADC2_AWD3      TIM1 ETR is connected to ADC2 AWD3
  *
  *         For TIM2, the parameter can take one of the following values:
  *            @arg TIM_TIM2_ETR_GPIO           TIM2 ETR is connected to GPIO
  *            @arg TIM_TIM2_ETR_COMP1          TIM2 ETR is connected to COMP1 OUT
  *            @arg TIM_TIM2_ETR_COMP2          TIM2 ETR is connected to COMP2 OUT
  *            @arg TIM_TIM2_ETR_MSIK           TIM2 ETR is connected to MSIK
  *            @arg TIM_TIM2_ETR_HSI            TIM2 ETR is connected to HSI
  *            @arg TIM_TIM2_ETR_TIM3_ETR       TIM2_ETR is connected to TIM3_ETR
  *            @arg TIM_TIM2_ETR_TIM4_ETR       TIM2_ETR is connected to TIM4_ETR
  *            @arg TIM_TIM2_ETR_LSE            TIM2_ETR is connected to LSE
  *            @arg TIM_TIM2_ETR_USBFS_SOF      TIM2_ETR is connected to USBFS OTG SOF
  *
  *         For TIM3, the parameter can take one of the following values:
   *           @arg TIM_TIM3_ETR_GPIO           TIM3 ETR is connected to GPIO
  *            @arg TIM_TIM3_ETR_COMP1          TIM3 ETR is connected to COMP1 OUT
  *            @arg TIM_TIM3_ETR_COMP2          TIM3 ETR is connected to COMP2 OUT
  *            @arg TIM_TIM3_ETR_MSIK           TIM3 ETR is connected to MSIK
  *            @arg TIM_TIM3_ETR_HSI            TIM3 ETR is connected to HSI
  *            @arg TIM_TIM3_ETR_TIM2_ETR       TIM3 ETR is connected to TIM2 ETR
  *            @arg TIM_TIM3_ETR_TIM4_ETR       TIM3 ETR is connected to TIM4_ETR
  *            @arg TIM_TIM3_ETR_ADC1_AWD1      TIM3 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM3_ETR_ADC1_AWD2      TIM3 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM3_ETR_ADC1_AWD3      TIM3 ETR is connected to ADC1 AWD3
  *
  *         For TIM4, the parameter can take one of the following values:
  *            @arg TIM_TIM4_ETR_GPIO           TIM4 ETR is connected to GPIO
  *            @arg TIM_TIM4_ETR_COMP1          TIM4 ETR is connected to COMP1 OUT
  *            @arg TIM_TIM4_ETR_COMP2          TIM4 ETR is connected to COMP2 OUT
  *            @arg TIM_TIM4_ETR_MSIK           TIM4 ETR is connected to MSIK
  *            @arg TIM_TIM4_ETR_HSI            TIM4 ETR is connected to HSI
  *            @arg TIM_TIM4_ETR_MSIS           TIM4_ETR is connected to MSIS
  *            @arg TIM_TIM4_ETR_TIM3_ETR       TIM4_ETR is connected to TIM3_ETR
  *
  *         For TIM8, the parameter can take one of the following values: (**)
  *            @arg TIM_TIM8_ETR_GPIO           TIM8 ETR is connected to GPIO
  *            @arg TIM_TIM8_ETR_COMP1          TIM8 ETR is connected to COMP1 OUT
  *            @arg TIM_TIM8_ETR_COMP2          TIM8 ETR is connected to COMP2 OUT
  *            @arg TIM_TIM8_ETR_MSIK           TIM8 ETR is connected to MSIK
  *            @arg TIM_TIM8_ETR_HSI            TIM8 ETR is connected to HSI
  *            @arg TIM_TIM8_ETR_ADC1_AWD1      TIM8 ETR is connected to ADC1 AWD1
  *            @arg TIM_TIM8_ETR_ADC1_AWD2      TIM8 ETR is connected to ADC1 AWD2
  *            @arg TIM_TIM8_ETR_ADC1_AWD3      TIM8 ETR is connected to ADC1 AWD3
  *            @arg TIM_TIM8_ETR_ADC2_AWD1      TIM8 ETR is connected to ADC2 AWD1
  *            @arg TIM_TIM8_ETR_ADC2_AWD2      TIM8 ETR is connected to ADC2 AWD2
  *            @arg TIM_TIM8_ETR_ADC2_AWD3      TIM8 ETR is connected to ADC2 AWD3
  *
  *         (**) Timer instance not available on all devices. \n
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIMEx_RemapConfig(TIM_HandleTypeDef *htim, uint32_t Remap)
{
  /* Check parameters */
  assert_param(IS_TIM_REMAP(htim->Instance, Remap));

  __HAL_LOCK(htim);

  MODIFY_REG(htim->Instance->AF1, TIM_AF1_ETRSEL_Msk, Remap);

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Select the timer input source
  * @param  htim TIM handle.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TI1 input channel
  *            @arg TIM_CHANNEL_2: TI2 input channel
  *            @arg TIM_CHANNEL_4: TI4 input channel
  * @param  TISelection parameter of the TIM_TISelectionStruct structure is detailed as follows:
  *         For TIM1, the parameter is one of the following values:
  *            @arg TIM_TIM1_TI1_GPIO:                TIM1 TI1 is connected to GPIO
  *            @arg TIM_TIM1_TI1_COMP1:               TIM1 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM1_TI1_COMP2:               TIM1 TI1 is connected to COMP2 OUT
  *
  *         For TIM2, the parameter is one of the following values:
  *            @arg TIM_TIM2_TI1_GPIO:                TIM2 TI1 is connected to GPIO
  *            @arg TIM_TIM2_TI1_COMP1:               TIM2 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM2_TI1_COMP2:               TIM2 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM2_TI2_GPIO:                TIM2 TI2 is connected to GPIO
  *            @arg TIM_TIM2_TI2_COMP1:               TIM2 TI2 is connected to COMP1 OUT
  *            @arg TIM_TIM2_TI2_COMP2:               TIM2 TI2 is connected to COMP2 OUT
  *            @arg TIM_TIM2_TI4_GPIO:                TIM2 TI4 is connected to GPIO
  *            @arg TIM_TIM2_TI4_COMP1:               TIM2 TI4 is connected to COMP1 OUT
  *            @arg TIM_TIM2_TI4_COMP2:               TIM2 TI4 is connected to COMP2 OUT
  *
  *         For TIM3, the parameter is one of the following values:
  *            @arg TIM_TIM3_TI1_GPIO:                TIM3 TI1 is connected to GPIO
  *            @arg TIM_TIM3_TI1_COMP1:               TIM3 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM3_TI1_COMP2:               TIM3 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM3_TI2_GPIO:                TIM3 TI2 is connected to GPIO
  *            @arg TIM_TIM3_TI2_COMP1:               TIM3 TI2 is connected to COMP1 OUT
  *            @arg TIM_TIM3_TI2_COMP2:               TIM3 TI2 is connected to COMP2 OUT
  *
  *         For TIM8, the parameter is one of the following values: (**)
  *            @arg TIM_TIM8_TI1_GPIO:                TIM8 TI1 is connected to GPIO
  *            @arg TIM_TIM8_TI1_COMP1:               TIM8 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM8_TI1_COMP2:               TIM8 TI1 is connected to COMP2 OUT
  *
  *         For TIM4, the parameter is one of the following values:
  *            @arg TIM_TIM4_TI1_GPIO:                TIM4 TI1 is connected to GPIO
  *            @arg TIM_TIM4_TI1_COMP1:               TIM4 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM4_TI1_COMP2:               TIM4 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM4_TI2_GPIO:                TIM4 TI2 is connected to GPIO
  *            @arg TIM_TIM3_TI2_COMP1:               TIM3 TI2 is connected to COMP1 OUT
  *            @arg TIM_TIM3_TI2_COMP2:               TIM3 sTI2 is connected to COMP2 OUT
  *
  *         For TIM12, the parameter is one of the following values: (**)
  *            @arg TIM_TIM12_TI1_GPIO:                TIM12 TI1 is connected to GPIO
  *            @arg TIM_TIM12_TI1_LSE                  TIM12 TI1 is connected to LSE
  *            @arg TIM_TIM12_TI1_COMP1:               TIM12 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM12_TI1_COMP2:               TIM12 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM12_TI1_I3C1_IBIACK          TIM12 TI1 is connected to I3C1 IBIACK
  *            @arg TIM_TIM12_TI2_GPIO:                TIM12 TI2 is connected to GPIO
  *            @arg TIM_TIM12_TI2_COMP2:               TIM12 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM12_TI2_I3C2_IBIACK:         TIM12 TI1 is connected to I3C2 IBIACK
  *
  *         For TIM15, the parameter is one of the following values:
  *            @arg TIM_TIM15_TI1_GPIO:                TIM15 TI1 is connected to GPIO
  *            @arg TIM_TIM15_TI1_LSE                  TIM15 TI1 is connected to LSE
  *            @arg TIM_TIM15_TI1_COMP1:               TIM15 TI1 is connected to COMP1 OUT
  *            @arg TIM_TIM15_TI1_COMP2:               TIM15 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM15_TI1_I3C1_IBIACK          TIM15 TI1 is connected to I3C1 IBIACK
  *            @arg TIM_TIM15_TI2_GPIO:                TIM15 TI2 is connected to GPIO
  *            @arg TIM_TIM15_TI2_COMP2:               TIM15 TI1 is connected to COMP2 OUT
  *            @arg TIM_TIM15_TI2_I3C2_IBIACK:         TIM15 TI1 is connected to I3C2 IBIACK
  *
  *         For TIM16, the parameter is one of the following values:
  *            @arg TIM_TIM16_TI1_GPIO:                TIM16 TI1 is connected to GPIO
  *            @arg TIM_TIM16_TI1_MCO:                 TIM16 TI1 is connected to MCO
  *            @arg TIM_TIM16_TI1_HSE_32:              TIM16 TI1 is connected to HSE DIV 32
  *            @arg TIM_TIM16_TI1_RTC_WKUP:            TIM16 TI1 is connected to RTC wakeup interrupt
  *            @arg TIM_TIM16_TI1_LSE:                 TIM16 TI1 is connected to LSE
  *            @arg TIM_TIM16_TI1_LSI:                 TIM16 TI1 is connected to LSI
  *            @arg TIM_TIM16_TI1_MSI_1024:            TIM16 TI1 is connected to MSI DIV 1024
  *            @arg TIM_TIM16_TI1_MSI_4:               TIM16 TI1 is connected to MSI DIV 4
  *            @arg TIM_TIM16_TI1_HSI_256:             TIM16 TI1 is connected to MSI DIV 256
  *            @arg TIM_TIM16_TI1_I3C1_IBIACK:         TIM16 TI1 is connected to I3C1 IBIACK
  *
  *         For TIM17, the parameter is one of the following values:
  *            @arg TIM_TIM17_TI1_GPIO:                TIM17 TI1 is connected to GPIO
  *            @arg TIM_TIM17_TI1_MCO:                 TIM17 TI1 is connected to MCO
  *            @arg TIM_TIM17_TI1_HSE_32:              TIM17 TI1 is connected to HSE DIV 32
  *            @arg TIM_TIM17_TI1_RTC_WKUP:            TIM17 TI1 is connected to RTC wakeup interrupt
  *            @arg TIM_TIM17_TI1_LSE:                 TIM17 TI1 is connected to LSE
  *            @arg TIM_TIM17_TI1_LSI:                 TIM17 TI1 is connected to LSI
  *            @arg TIM_TIM17_TI1_MSI_1024:            TIM17 TI1 is connected to MSI DIV 1024
  *            @arg TIM_TIM17_TI1_MSI_4:               TIM17 TI1 is connected to MSI DIV 4
  *            @arg TIM_TIM17_TI1_HSI_256:             TIM17 TI1 is connected to MSI DIV 256
  *            @arg TIM_TIM17_TI1_I3C2_IBIACK:         TIM17 TI1 is connected to I3C2 IBIACK
  *
  *         (**) Timer instance not available on all devices. \n
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_TIMEx_TISelection(TIM_HandleTypeDef *htim, uint32_t TISelection, uint32_t Channel)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_TIM_TISEL_TIX_INSTANCE(htim->Instance, Channel));
  assert_param(IS_TIM_TISEL(TISelection));

  __HAL_LOCK(htim);

  switch (Channel)
  {
    case TIM_CHANNEL_1:
      MODIFY_REG(htim->Instance->TISEL, TIM_TISEL_TI1SEL, TISelection);

